# Concatenate, Merge and Join Data

In [7]:
import pandas as pd
import numpy as np

df_1 = pd.DataFrame({'A' : np.array([1, 2, 3]),
                     'B' : np.array([4, 5, 6])}, index=[1, 2, 3])

df_1

   A  B
1  1  4
2  2  5
3  3  6

In [8]:
df_2 = pd.DataFrame({'A' : np.array([7, 8, 9]),
                     'B' : np.array([10, 11, 12])}, 
                    index=[4, 5, 6])

df_2

   A   B
4  7  10
5  8  11
6  9  12

In [11]:
# concatenate

pd.concat([df_1, df_2]) # order that i want them to be concatenated

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

# MERGE

In [12]:
df_1 = pd.DataFrame({'A' : np.array([1, 2, 3]),
                     'B' : np.array([4, 5, 6]),
                     'key' : np.array([1, 2, 3])})

df_2 = pd.DataFrame({'A' : np.array([7, 8, 9]),
                     'B' : np.array([10, 11, 12]),
                     'key' : np.array([1, 2, 3])})

In [14]:
# merge two dataframes that share a common colunm which is key
pd.merge(df_1, df_2, how='inner', on='key') # how, defines how it's going to be merge (inner is inner merge), on='key' -> collunm

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [15]:
pd.merge(df_1, df_2, how='left', on='key') # how, defines how it's going to be merge (left is left merge), on='key' -> collunm

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [16]:
pd.merge(df_1, df_2, how='right', on='key') # how, defines how it's going to be merge (right is right merge), on='key' -> collunm

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [17]:
pd.merge(df_1, df_2, how='outer', on='key') # how, defines how it's going to be merge (outer is outer merge), on='key' -> collunm

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

# JOIN

In [40]:
df_1 = pd.DataFrame({'A' : np.array([1, 2, 3]),
                     'B' : np.array([4, 5, 6])}, index=[1, 2, 3])

df_2 = pd.DataFrame({'C' : np.array([7, 8, 9]),
                     'D' : np.array([10, 11, 12])}, 
                    index=[1, 4, 5])

In [41]:
df_1.join(df_2, how='outer') # union of keys

     A    B    C     D
1  1.0  4.0  7.0  10.0
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  8.0  11.0
5  NaN  NaN  9.0  12.0

In [42]:
df_1.join(df_2, how='left') # union of keys

   A  B    C     D
1  1  4  7.0  10.0
2  2  5  NaN   NaN
3  3  6  NaN   NaN

In [43]:
df_1.join(df_2, how='right') # union of keys

     A    B  C   D
1  1.0  4.0  7  10
4  NaN  NaN  8  11
5  NaN  NaN  9  12

In [44]:
df_1.join(df_2, how='inner') # union of keys

   A  B  C   D
1  1  4  7  10

# Statistics

In [45]:
pd_file = pd.read_csv('icecreamsales.csv')

In [46]:
pd_file.head()

   Temperature  Sales
0           37    292
1           40    228
2           49    324
3           61    376
4           72    440

In [47]:
pd_file.describe()

       Temperature       Sales
count    12.000000   12.000000
mean     61.166667  400.000000
std      17.055169  105.651227
min      37.000000  228.000000
25%      46.750000  323.000000
50%      62.500000  394.000000
75%      76.000000  496.000000
max      83.000000  556.000000

In [49]:
# give the total count of both collunms
pd_file.count()

Temperature    12
Sales          12
dtype: int64

In [50]:
# sum the values
pd_file.sum()

Temperature     734
Sales          4800
dtype: int64

In [51]:
# colocando nan no dado para poder um o sum e pular isso
pd_file.iloc[0, 0] = np.nan

In [52]:
pd_file

    Temperature  Sales
0           NaN    292
1          40.0    228
2          49.0    324
3          61.0    376
4          72.0    440
5          79.0    496
6          83.0    536
7          81.0    556
8          75.0    496
9          64.0    412
10         53.0    324
11         40.0    320

In [54]:
# sum the values
pd_file.sum(skipna = True) # pula nan

Temperature     697.0
Sales          4800.0
dtype: float64

In [ ]:
pd_file.sum # se clicar em shift + tab, o jupyter exibe os parametros do metodo

In [56]:
# mean of the sales collunm
pd_file['Sales'].mean()

400.0

In [58]:
# median of the sales collunm
pd_file['Sales'].median()

394.0

In [59]:
# mode of the sales collunm
pd_file['Sales'].mode()

0    324
1    496
dtype: int64

In [60]:
# max of the sales collunm
pd_file['Sales'].max()

556

In [61]:
# min of the sales collunm
pd_file['Sales'].min()

228

In [62]:
# product of the sales collunm
pd_file['Sales'].product()

4582080946295013376

In [63]:
# standard deviation of the sales collunm
pd_file['Sales'].std()

105.65122724408751

In [64]:
# variation of the sales collunm
pd_file['Sales'].var()

11162.181818181818

In [66]:
# standard error of the sales collunm
pd_file['Sales'].sem()

30.498882244794125

In [67]:
# how the values skew in a graph - Skewness, in statistics, is the degree of asymmetry observed in a probability distribution.
pd_file['Sales'].skew() 
# if negativo, long tail towards the left, 0 is prety well spread out, and if positive, tail along the right

0.036552031682046925

In [72]:
# kurt of the sales collunm
# An outlier is an observation that lies an abnormal distance from other values in a random sample from a population
pd_file['Sales'].kurt() 
# tell how many outliers we have in the data, less than 3, few outliers, at 3, normal distribution, greater than 3, a lot of outliers

-1.2179973006069797

In [73]:
# quentile of the sales collunm
pd_file['Sales'].quantile(0.5)

394.0

In [75]:
# cumulative sum of the sales collunm
pd_file['Sales'].cumsum()

0      292
1      520
2      844
3     1220
4     1660
5     2156
6     2692
7     3248
8     3744
9     4156
10    4480
11    4800
Name: Sales, dtype: int64

In [76]:
# cumulative product of the sales collunm
pd_file['Sales'].cumprod()

0                     292
1                   66576
2                21570624
3              8110554624
4           3568644034560
5        1770047441141760
6      948745428451983360
7    -7453119918274248704
8    -7398664722117033984
9    -4537093350141984768
10    5721280450761064448
11    4582080946295013376
Name: Sales, dtype: int64

In [77]:
# cumulative max of the sales collunm
pd_file['Sales'].cummax()

0     292
1     292
2     324
3     376
4     440
5     496
6     536
7     556
8     556
9     556
10    556
11    556
Name: Sales, dtype: int64

In [78]:
# cumulative min of the sales collunm
pd_file['Sales'].cummin()

0     292
1     228
2     228
3     228
4     228
5     228
6     228
7     228
8     228
9     228
10    228
11    228
Name: Sales, dtype: int64

In [79]:
# cumulative min of the sales collunm
pd_file['Sales'].describe()

count     12.000000
mean     400.000000
std      105.651227
min      228.000000
25%      323.000000
50%      394.000000
75%      496.000000
max      556.000000
Name: Sales, dtype: float64

In [83]:
series_dice = pd.Series(data = [2, 3, 3, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 6, 6, 
                                7, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 9, 9, 9, 9, 
                                10, 10, 10, 11, 11, 12])

In [84]:
series_dice.value_counts() # cont of values

7     6
8     5
6     5
9     4
5     4
10    3
4     3
11    2
3     2
12    1
2     1
dtype: int64

In [89]:
df_2 = pd.DataFrame({'one' : [1., 2., 3., 0.], 'two' : [1., 2., 3., 4.]}, index=['a', 'b', 'c', 'd'])
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

In [94]:
# Aggregate using one or more operations over the specified axis
# np.mean = Compute the arithmetic mean along the specified axis

df_2.agg(np.mean) # using aggregate to compute the mean over cols which is 0

one    1.5
two    2.5
dtype: float64

In [93]:
df_2.agg(np.mean, axis=1) # using aggregate in the rows

a    1.0
b    2.0
c    3.0
d    2.0
dtype: float64

In [97]:
# using a combination of stats in a table
df_2.agg(['mean', 'std', 'var'])

           one       two
mean  1.500000  2.500000
std   1.290994  1.290994
var   1.666667  1.666667

# Iteration

In [99]:
ser = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e']) # criando uma series de 0 a 5, linear, os labels est√£o especificados

In [102]:
arr = np.random.randint(10, 50, size=(2, 3)) # matrix de 2 linhas e 3 colunas, com valores aleatorios entre 10 e 50 - 1

In [103]:
df = pd.DataFrame(arr, ['B', 'C'], ['C', 'D', 'E']) # data frame com o array criado anteriormente e labels da linha e coluna

In [104]:
for col in ser:
    print(col)

0
1
2
3
4

In [114]:
for label, series in df.items():
    print(str(label) + '\n' + str(series))

C
B    49
C    40
Name: C, dtype: int32
D
B    25
C    22
Name: D, dtype: int32
E
B    43
C    24
Name: E, dtype: int32

In [116]:
# iterate through rows
for index, row in df.iterrows():
    print(f'{index}\n{row}\n')

B
C    49
D    25
E    43
Name: B, dtype: int32

C
C    40
D    22
E    24
Name: C, dtype: int32

In [117]:
# get tuple that contias rows data
for row in df.itertuples():
    print(row)

Pandas(Index='B', C=49, D=25, E=43)
Pandas(Index='C', C=40, D=22, E=24)

# SORT

In [118]:
df

    C   D   E
B  49  25  43
C  40  22  24

In [120]:
df.sort_index() # if index is in order, it return the same data order

    C   D   E
B  49  25  43
C  40  22  24

In [122]:
df.sort_index(ascending=False) # return in descending

    C   D   E
C  40  22  24
B  49  25  43

In [124]:
df.sort_values(by='C', ascending=False) # sort datafram using specific colunm

    C   D   E
B  49  25  43
C  40  22  24

# Manipulate Data with Functions

In [134]:
cs_df = pd.read_csv('ComputerSales.csv')

cs_df.head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018

In [136]:
import sys


def get_profit_total(df):
    prof_series = df['Profit']
    print(f'Total profit : {prof_series.sum()}')
    
get_profit_total(cs_df)

Total profit : 5459.010000000001

In [140]:
# dataframe to split the contact name into first name and last name
def split_name(df):
    def get_name(namefull):
        f_name, l_name = namefull.split() # spliting by space
        return pd.Series((f_name, l_name), 
                         index=['First Name', 'Last Name'])

    names = df['Contact'].apply(get_name) # applying the function
    df[names.columns] = names # colunms names are first and last name
    return df


split_name(cs_df).head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First Name,Last Name
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk

# Diving Data

In [142]:
# assing people into differnet groups based on their ages
def create_group(df):
    bins = [0, 30, 50, sys.maxsize] # dividing people into these groups: 0 to 30, 30 to 50, and 50 >
    labels = ['<30', '30-50', '>50']
    # cut put value into certain group based in intervals
    age_group = pd.cut(df['Age'], bins=bins, labels=labels)
    # creating a new colunm to put it
    df['age group'] = age_group
    return df

create_group(cs_df).head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First Name,Last Name,age group
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas,30-50
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms,30-50
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine,<30
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert,30-50
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk,>50

In [143]:
# using pipe to pass dataframe to many function
cs_df.pipe(split_name).pipe(create_group).head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First Name,Last Name,age group
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas,30-50
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms,30-50
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine,<30
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert,30-50
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk,>50